In [1]:
import numpy as np
import matplotlib.pyplot as  plt
import pandas as pd
import warnings
warnings.filterwarnings('ignore')
%matplotlib inline
import seaborn as sns

In [111]:
path = 'F:/Books/Machine Learning/DataSets/Titanic'
train_data = pd.read_csv(path + '/train.csv')
test_data = pd.read_csv(path + '/test.csv')
sub_data = pd.read_csv(path + '/gender_submission.csv')

In [112]:
print(train_data.shape)
print(test_data.shape)
print(sub_data.shape)

(891, 12)
(418, 11)
(418, 2)

In [113]:
all_data  = pd.concat([train_data.drop(['Survived'],axis=1),test_data],axis=0)
all_data.shape

(1309, 11)

In [114]:
raw_label = train_data.Survived
train_data.drop('Survived',inplace=True,axis=1)
raw_label.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [117]:
train_data.isna().sum()[train_data.isna().sum() != 0 ]

Age         177
Cabin       687
Embarked      2
dtype: int64

In [118]:
test_data.isna().sum()[test_data.isna().sum() != 0 ]

Age       86
Fare       1
Cabin    327
dtype: int64

In [119]:
all_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [120]:
drop_feat = ['PassengerId','Name','Ticket','Cabin']

In [121]:
all_data.isna().sum()[all_data.isna().sum()!=0]

Age          263
Fare           1
Cabin       1014
Embarked       2
dtype: int64

In [122]:
all_data.Embarked.fillna(all_data.Embarked.mode().tolist()[0], inplace=True)
all_data.Fare.fillna(all_data.Fare.mode().tolist()[0], inplace=True)
m = all_data.Age.mean()
std = all_data.Age.std()/2
all_data.Age[all_data.Age.isna()] = np.random.normal(m,std,all_data.Age.isna().sum())

In [123]:
all_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [124]:
drop_feat.append('Cabin')

In [125]:
all_data.drop(drop_feat,axis=1,inplace=True)
all_data.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  22.0      1      0   7.2500        S
1       1  female  38.0      1      0  71.2833        C
2       3  female  26.0      0      0   7.9250        S
3       1  female  35.0      1      0  53.1000        S
4       3    male  35.0      0      0   8.0500        S

In [141]:
all_data.to_csv('all_data.csv',index = False)
pd.DataFrame(raw_label).to_csv('labels.csv',index=False)